src/Documents/ИС_Ozon_Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_Ozon_Заказ</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>delivery_type</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>tpl_provider</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>delivering_date</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>lower_barcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>upper_barcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>is_multibox</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>multi_box_qty</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>order_number</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>address_tail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>customer_email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>delivery_method_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shipment_date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>order_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>tracking_number</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>is_express</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказФБО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>products</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураOzon</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаOzon</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_Ozon_Штрихкоды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>requiring_gtd</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>requiring_country</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>requiring_mandatory_mark</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>requiring_rnpt</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИС_Ozon_СоответствиеХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Ozon_СоответствиеХарактеристик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураOzon</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_МП_Маркетплейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_МП_Маркетплейсы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Озон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сбер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Али</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ламода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПередачаТоваровХранителю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПередачаТоваровХранителю</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ИС_Ozon_Заказ/Forms/ФормаКиЗов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Мурсалимов Д.Р. 20.04.24 УА #74269
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Параметры.Свойство("Профиль") Тогда
		Профиль = Параметры.Профиль;
	Иначе
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль");
	КонецЕсли; 
	
	Если Параметры.Свойство("СборочныеЗадания") Тогда
		ЗаполнитьТаблицуВыгрузки(Профиль, Параметры.СборочныеЗадания);
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Нет данных для выгрузки КиЗов");
	КонецЕсли;
	
	//+ ИнфоСофт Заварин К.В. 04.04.25 УА #95143
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	//- ИнфоСофт Заварин К.В. 04.04.25 УА #95143
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 20.04.24 УА #74269 

//+ ИнфоСофт Заварин К.В. 04.04.25 УА #95143
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ИспользоватьПодключаемоеОборудование = Истина;
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 04.04.25 УА #95143

//+ ИнфоСофт Заварин К.В. 04.04.25 УА #95143
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 04.04.25 УА #95143

//+ ИнфоСофт Заварин К.В. 04.04.25 УА #95143
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			СтруктураШтрихкод = МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
			ОбработатьШтрихкоды(СтруктураШтрихкод);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 04.04.25 УА #95143

#КонецОбласти

#Область ОбработчикиКомандФормы 

//+ ИнфоСофт Мурсалимов Д.Р. 20.04.24 УА #74269
&НаКлиенте
Процедура ВыгрузитьКиЗы(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	Если ДанныеКВыгрузке.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нет данных для выгрузки");
		Возврат;
	КонецЕсли;
	
	НеЗаполненКиз = Ложь;
	
	Для Каждого Строка Из ДанныеКВыгрузке Цикл
		
		Если Не ЗначениеЗаполнено(Строка.КодМаркировки) Тогда
			НеЗаполненКиз = Истина;  
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НеЗаполненКиз Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВыгрузитьКиЗыЗавершение", ЭтотОбъект, Параметры);
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, 
		НСтр("ru = 'В выгружаемых данных КиЗ должен быть заполнен. Уверены что хотите выгрузить КиЗы?'"), 
		РежимДиалогаВопрос.ДаНет);
		
	Иначе
		ВыгрузитьКиЗыНаСервере();
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 20.04.24 УА #74269

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

//+ ИнфоСофт Мурсалимов Д.Р. 19.04.24 УА #74269
&НаСервере
Процедура ЗаполнитьТаблицуВыгрузки(Профиль, МассивЗаказов)
	
	ТЗ_Заказы = Новый ТаблицаЗначений;
	
	ТЗ_Заказы.Колонки.Добавить("НомерОтправления");
	
	//+ ИнфоСофт Заварин К.В. 22.03.25 УА #79811
	//ТЗ_Заказы.Колонки.Добавить("Заказ1С");
	ТЗ_Заказы.Колонки.Добавить("Заказ1С", Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента")); 
	//- ИнфоСофт Заварин К.В. 22.03.25 УА #79811
	
	ТЗ_Заказы.Колонки.Добавить("РеализацияТоваровУслуг");
	ТЗ_Заказы.Колонки.Добавить("Номенклатура");
	ТЗ_Заказы.Колонки.Добавить("Характеристика");
	ТЗ_Заказы.Колонки.Добавить("НомерСтр");
	ТЗ_Заказы.Колонки.Добавить("exemplar_id");
	ТЗ_Заказы.Колонки.Добавить("product_id");
	ТЗ_Заказы.Колонки.Добавить("offer_id");
	ТЗ_Заказы.Колонки.Добавить("quantity");
	ТЗ_Заказы.Колонки.Добавить("КодМаркировки");
	
	//+ ИнфоСофт Заварин К.В. 18.03.25 УА #79811
	ТЗ_Заказы.Колонки.Добавить("НомерГТД");
	ТЗ_Заказы.Колонки.Добавить("НеобходимаПередачаГТД");
	//- ИнфоСофт Заварин К.В. 18.03.25 УА #79811
	
	НомерСтр = 1;
	
	ТекНоменклатура = Неопределено;
	ТекХарактеристика = Неопределено;
	ТекРеализацияТоваровУслуг = Неопределено;
	
	ЗапросРТУ = Новый Запрос; 

	//+ ИнфоСофт Заварин К.В. 03.02.25 УА #92764
	//+ ИнфоСофт Ивонин К.А. 04.02.25 УА #92887
	//Если ИС_MP_Сервер.ПолучитьВерсиюБезРедакции() >= "5.19.44" Тогда
	ВерсияБезРедации = ИС_МП_Сервер.ВерсияБезРедакции();
	
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(ВерсияБезРедации, "5.19.44") >= 0 Тогда
	//- ИнфоСофт Ивонин К.А. 04.02.25 УА #92887
		
		ЗапросРТУ.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ozon_Заказ.Заказ КАК Заказ,
		|	ИС_Ozon_Заказ.Номер КАК Номер,
		|	ИС_Ozon_Заказproducts.НоменклатураOzon.offer_id КАК offer_id,
		|	ИС_Ozon_Заказproducts.quantity КАК quantity,
		|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
		|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК Характеристика,
		|	ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.sku КАК product_id,
		//+ ИнфоСофт Заварин К.В. 21.03.25 УА #79811
		|	ИС_Ozon_Заказproducts.requiring_gtd КАК requiring_gtd
		//- ИнфоСофт Заварин К.В. 21.03.25 УА #79811
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	Документ.ИС_Ozon_Заказ.products КАК ИС_Ozon_Заказproducts
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
		|		ПО (ИС_Ozon_Заказproducts.Ссылка = ИС_Ozon_Заказ.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
		|		ПО (ИС_Ozon_Заказproducts.НоменклатураOzon = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon)
		|ГДЕ
		|	ИС_Ozon_Заказ.Ссылка В(&МассивЗаказов)
		|	И ИС_Ozon_Заказ.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		//+ ИнфоСофт Заварин К.В. 21.03.25 УА #79811
		//|	И ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета)
		|	И (ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета)
		|	ИЛИ ИС_Ozon_Заказproducts.requiring_gtd = ИСТИНА)
		//- ИнфоСофт Заварин К.В. 21.03.25 УА #79811		
		//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
		|	И НЕ ИС_Ozon_Заказ.ЗаказФБО
		//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка КАК РеализацияТоваровУслуг,
		|	ВТ_Номенклатура.offer_id КАК offer_id,
		|	ВТ_Номенклатура.product_id КАК product_id,
		|	ВТ_Номенклатура.quantity КАК Количество,
		|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
		|	ВТ_Номенклатура.Характеристика КАК Характеристика,
		|	ВТ_Номенклатура.Заказ КАК Заказ,
		//+ ИнфоСофт Заварин К.В. 21.03.25 УА #79811
		|	ВТ_Номенклатура.requiring_gtd КАК requiring_gtd,
		//- ИнфоСофт Заварин К.В. 21.03.25 УА #79811
		|	ВТ_Номенклатура.Номер КАК Номер
		|ПОМЕСТИТЬ ВТ_РТУ
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО ВТ_Номенклатура.Заказ = РеализацияТоваровУслугТовары.ЗаказКлиента
		|			И ВТ_Номенклатура.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура
		|			И ВТ_Номенклатура.Характеристика = РеализацияТоваровУслугТовары.Характеристика
		|ГДЕ
		|	НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Ссылка,
		|	ВТ_Номенклатура.offer_id,
		|	ВТ_Номенклатура.product_id,
		|	ВТ_Номенклатура.quantity,
		|	ВТ_Номенклатура.Номенклатура,
		|	ВТ_Номенклатура.Характеристика,
		|	ВТ_Номенклатура.Заказ, 
		//+ ИнфоСофт Заварин К.В. 21.03.25 УА #79811
		|	ВТ_Номенклатура.requiring_gtd,
		//- ИнфоСофт Заварин К.В. 21.03.25 УА #79811
		|	ВТ_Номенклатура.Номер
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПередачаТоваровХранителюТовары.Ссылка,
		|	ВТ_Номенклатура.offer_id,
		|	ВТ_Номенклатура.product_id,
		|	ВТ_Номенклатура.quantity,
		|	ВТ_Номенклатура.Номенклатура,
		|	ВТ_Номенклатура.Характеристика,
		|	ВТ_Номенклатура.Заказ,
		//+ ИнфоСофт Заварин К.В. 21.03.25 УА #79811
		|	ВТ_Номенклатура.requiring_gtd,
		//- ИнфоСофт Заварин К.В. 21.03.25 УА #79811
		|	ВТ_Номенклатура.Номер
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
		|		ПО ВТ_Номенклатура.Заказ = ПередачаТоваровХранителюТовары.ЗаказКлиента
		|			И ВТ_Номенклатура.Номенклатура = ПередачаТоваровХранителюТовары.Номенклатура
		|			И ВТ_Номенклатура.Характеристика = ПередачаТоваровХранителюТовары.Характеристика
		|ГДЕ
		|	НЕ ПередачаТоваровХранителюТовары.Ссылка ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ПередачаТоваровХранителюТовары.Ссылка,
		|	ВТ_Номенклатура.offer_id,
		|	ВТ_Номенклатура.product_id,
		|	ВТ_Номенклатура.quantity,
		|	ВТ_Номенклатура.Номенклатура,
		|	ВТ_Номенклатура.Характеристика,
		|	ВТ_Номенклатура.Заказ,
		//+ ИнфоСофт Заварин К.В. 21.03.25 УА #79811
		|	ВТ_Номенклатура.requiring_gtd,
		//- ИнфоСофт Заварин К.В. 21.03.25 УА #79811
		|	ВТ_Номенклатура.Номер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РТУ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг,
		|	ВТ_РТУ.offer_id КАК offer_id,
		|	ВТ_РТУ.product_id КАК product_id,
		|	ВТ_РТУ.Количество КАК Количество,
		|	ВТ_РТУ.Номенклатура КАК Номенклатура,
		|	ВТ_РТУ.Характеристика КАК Характеристика,
		|	ВТ_РТУ.Заказ КАК Заказ,
		//+ ИнфоСофт Заварин К.В. 21.03.25 УА #79811
		|	ВТ_РТУ.requiring_gtd КАК НеобходимаПередачаГТД,
		//- ИнфоСофт Заварин К.В. 21.03.25 УА #79811
		|	ВТ_РТУ.Номер КАК Номер
		|ИЗ
		|	ВТ_РТУ КАК ВТ_РТУ
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияТоваровУслуг,
		|	Номенклатура,
		|	Характеристика";
	Иначе
		ЗапросРТУ.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ozon_Заказ.Заказ КАК Заказ,
		|	ИС_Ozon_Заказ.Номер КАК Номер,
		|	ИС_Ozon_Заказproducts.НоменклатураOzon.offer_id КАК offer_id,
		|	ИС_Ozon_Заказproducts.quantity КАК quantity, 
		//+ ИнфоСофт Заварин К.В. 21.03.25 УА #79811
		|	ИС_Ozon_Заказproducts.requiring_gtd КАК requiring_gtd,
		//- ИнфоСофт Заварин К.В. 21.03.25 УА #79811
		|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
		|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК Характеристика,
		|	ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.sku КАК product_id
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	Документ.ИС_Ozon_Заказ.products КАК ИС_Ozon_Заказproducts
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
		|		ПО (ИС_Ozon_Заказproducts.Ссылка = ИС_Ozon_Заказ.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
		|		ПО (ИС_Ozon_Заказproducts.НоменклатураOzon = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon)
		|ГДЕ
		|	ИС_Ozon_Заказ.Ссылка В(&МассивЗаказов)
		|	И ИС_Ozon_Заказ.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		//+ ИнфоСофт Заварин К.В. 21.03.25 УА #79811
		//|	И ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета)
		|	И (ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета)
		|	ИЛИ ИС_Ozon_Заказproducts.requiring_gtd = ИСТИНА)
		//- ИнфоСофт Заварин К.В. 21.03.25 УА #79811
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка КАК РеализацияТоваровУслуг,
		|	ВТ_Номенклатура.offer_id КАК offer_id,
		|	ВТ_Номенклатура.product_id КАК product_id,
		|	ВТ_Номенклатура.quantity КАК Количество,
		|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
		|	ВТ_Номенклатура.Характеристика КАК Характеристика,
		|	ВТ_Номенклатура.Заказ КАК Заказ,
		//+ ИнфоСофт Заварин К.В. 21.03.25 УА #79811
		|	ВТ_Номенклатура.requiring_gtd КАК НеобходимаПередачаГТД,
        //- ИнфоСофт Заварин К.В. 21.03.25 УА #79811
		|	ВТ_Номенклатура.Номер КАК Номер
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО ВТ_Номенклатура.Заказ = РеализацияТоваровУслугТовары.ЗаказКлиента
		|			И ВТ_Номенклатура.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура
		|			И ВТ_Номенклатура.Характеристика = РеализацияТоваровУслугТовары.Характеристика
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Ссылка,
		|	ВТ_Номенклатура.offer_id,
		|	ВТ_Номенклатура.product_id,
		|	ВТ_Номенклатура.quantity,
		|	ВТ_Номенклатура.Номенклатура,
		|	ВТ_Номенклатура.Характеристика,
		|	ВТ_Номенклатура.Заказ,
		//+ ИнфоСофт Заварин К.В. 21.03.25 УА #79811
		|	ВТ_Номенклатура.requiring_gtd,
		//- ИнфоСофт Заварин К.В. 21.03.25 УА #79811
		|	ВТ_Номенклатура.Номер
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияТоваровУслуг,
		|	Номенклатура,
		|	Характеристика";	
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 03.02.25 УА #92764	
	
	ЗапросРТУ.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	
	РезультатЗапросаКоды = ЗапросРТУ.Выполнить();
	
	ВыборкаРТУ = РезультатЗапросаКоды.Выбрать();
	
	Пока ВыборкаРТУ.Следующий() Цикл
		
		Для Счетчик = 1 По ВыборкаРТУ.Количество Цикл
			
			Если ВыборкаРТУ.РеализацияТоваровУслуг = ТекРеализацияТоваровУслуг И ВыборкаРТУ.Номенклатура = ТекНоменклатура И ВыборкаРТУ.Характеристика = ТекХарактеристика Тогда				
				НомерСтр = НомерСтр + 1;	
			Иначе	
				НомерСтр = 1;		
			КонецЕсли;
			
			НоваяСтрока 					= ТЗ_Заказы.Добавить();
			НоваяСтрока.НомерСтр			= НомерСтр;
			НоваяСтрока.НомерОтправления 	= ВыборкаРТУ.Номер;
			НоваяСтрока.Заказ1С 			= ВыборкаРТУ.Заказ;
			
			//+ ИнфоСофт Заварин К.В. 21.03.25 УА #79811
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРТУ, "РеализацияТоваровУслуг,offer_id,product_id,Номенклатура,Характеристика, НеобходимаПередачаГТД");  
			//ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРТУ, "РеализацияТоваровУслуг,offer_id,product_id,Номенклатура,Характеристика");
			//- ИнфоСофт Заварин К.В. 21.03.25 УА #79811
			
			ТекНоменклатура = НоваяСтрока.Номенклатура;
			ТекХарактеристика = НоваяСтрока.Характеристика;
			ТекРеализацияТоваровУслуг = НоваяСтрока.РеализацияТоваровУслуг;
			
		КонецЦикла;
		
	КонецЦикла; 	
	
	РасходныеНакладные = Новый Массив;	
	РасходныеНакладные = ТЗ_Заказы.ВыгрузитьКолонку("РеализацияТоваровУслуг");
	
	Если РасходныеНакладные.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Получение Реализаций по данным заказов завершилось с ошибкой");
	КонецЕсли;
	
	РасходныеНакладные = ОбщегоНазначенияКлиентСервер.СвернутьМассив(РасходныеНакладные);	
	
	ЗапросКоды = Новый Запрос;

	//+ ИнфоСофт Заварин К.В. 03.02.25 УА #92764
	//+ ИнфоСофт Ивонин К.А. 04.02.25 УА #92887
	//Если ИС_MP_Сервер.ПолучитьВерсиюБезРедакции() >= "5.19.44" Тогда
	ВерсияБезРедации = ИС_МП_Сервер.ВерсияБезРедакции();
	
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(ВерсияБезРедации, "5.19.44") >= 0 Тогда
	//- ИнфоСофт Ивонин К.А. 04.02.25 УА #92887
		
		ЗапросКоды.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка КАК РеализацияТоваровУслуг,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТ_ШтрихкодУпаковкиРТУ
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК РеализацияТоваровУслугШтрихкодыУпаковок
		|ГДЕ
		|	РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка В(&МассивРТУ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.Ссылка,
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.ШтрихкодУпаковки,
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода,
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура,
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.ШтрихкодУпаковки.Характеристика
		|ИЗ
		|	Документ.ПередачаТоваровХранителю.ШтрихкодыУпаковок КАК ПередачаТоваровХранителюШтрихкодыУпаковок
		|ГДЕ
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.Ссылка В(&МассивРТУ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ШтрихкодУпаковкиРТУ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг,
		|	ВТ_ШтрихкодУпаковкиРТУ.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	ВТ_ШтрихкодУпаковкиРТУ.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|	ВТ_ШтрихкодУпаковкиРТУ.Номенклатура КАК Номенклатура,
		|	ВТ_ШтрихкодУпаковкиРТУ.Характеристика КАК Характеристика
		|ИЗ
		|	ВТ_ШтрихкодУпаковкиРТУ КАК ВТ_ШтрихкодУпаковкиРТУ
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияТоваровУслуг,
		|	Номенклатура,
		|	Характеристика";
		
	Иначе
		
		ЗапросКоды.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка КАК РеализацияТоваровУслуг,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Характеристика КАК Характеристика
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК РеализацияТоваровУслугШтрихкодыУпаковок
		|ГДЕ
		|	РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка В(&МассивРТУ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияТоваровУслуг,
		|	Номенклатура,
		|	Характеристика";
		
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 03.02.25 УА #92764
	
	ЗапросКоды.УстановитьПараметр("МассивРТУ", РасходныеНакладные);
	
	РезультатЗапросаКизы = ЗапросКоды.Выполнить();
	
	Выборка_Кизы = РезультатЗапросаКизы.Выбрать();
	
	НомерСтр = 1;
	
	ТекНоменклатура = Неопределено;
	ТекХарактеристика = Неопределено;
	ТекРеализацияТоваровУслуг = Неопределено;
	
	ТЗ_Кизы = Новый ТаблицаЗначений;
	ТЗ_Кизы.Колонки.Добавить("НомерСтр"); 
	ТЗ_Кизы.Колонки.Добавить("РеализацияТоваровУслуг");
	ТЗ_Кизы.Колонки.Добавить("ШтрихкодУпаковки");
	ТЗ_Кизы.Колонки.Добавить("ЗначениеШтрихкода");
	ТЗ_Кизы.Колонки.Добавить("Номенклатура");
	ТЗ_Кизы.Колонки.Добавить("Характеристика");
	
	Пока Выборка_Кизы.Следующий() Цикл
		
		Если Выборка_Кизы.РеализацияТоваровУслуг = ТекРеализацияТоваровУслуг И Выборка_Кизы.Номенклатура = ТекНоменклатура И Выборка_Кизы.Характеристика = ТекХарактеристика Тогда				
			НомерСтр = НомерСтр + 1;	
		Иначе	
			НомерСтр = 1;		
		КонецЕсли;
		
		НоваяСтрока = ТЗ_Кизы.Добавить();	
		НоваяСтрока.НомерСтр = НомерСтр;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка_Кизы);
		
		ТекНоменклатура = НоваяСтрока.Номенклатура;
		ТекХарактеристика = НоваяСтрока.Характеристика;
		ТекРеализацияТоваровУслуг = НоваяСтрока.РеализацияТоваровУслуг;
		
	КонецЦикла;
	
	//+ ИнфоСофт Заварин К.В. 18.03.25 УА #79811
	Если ПолучитьФункциональнуюОпцию("ИспользоватьИмпортныеТовары") Тогда		
		
		ЗапросГТД = Новый Запрос;
		ЗапросГТД.Текст =	
		"ВЫБРАТЬ
		|	ТЗ.Заказ1С КАК Заказ1С
		|ПОМЕСТИТЬ ВТ_ТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ТЗ.Заказ1С КАК Заказ1С
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	ВТ_ТЗ КАК ВТ_ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугВидыЗапасов.Ссылка КАК РеализацияТоваровУслуг,
		|	РеализацияТоваровУслугВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугВидыЗапасов.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	РеализацияТоваровУслугВидыЗапасов.Количество КАК Количество,
		|	РеализацияТоваровУслугВидыЗапасов.НомерГТД КАК НомерГТД
		|ПОМЕСТИТЬ ВТ_ШтрихкодУпаковкиРТУ
		|ИЗ
		|	ВТ_Заказы КАК ВТ_Заказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК РеализацияТоваровУслугВидыЗапасов
		|		ПО (РеализацияТоваровУслугВидыЗапасов.ЗаказКлиента = ВТ_Заказы.Заказ1С)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПередачаТоваровХранителюВидыЗапасов.Ссылка,
		|	ПередачаТоваровХранителюВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура,
		|	ПередачаТоваровХранителюВидыЗапасов.АналитикаУчетаНоменклатуры.Характеристика,
		|	ПередачаТоваровХранителюВидыЗапасов.Количество,
		|	ПередачаТоваровХранителюВидыЗапасов.НомерГТД
		|ИЗ
		|	ВТ_Заказы КАК ВТ_Заказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.ВидыЗапасов КАК ПередачаТоваровХранителюВидыЗапасов
		|		ПО (ПередачаТоваровХранителюВидыЗапасов.ЗаказКлиента = ВТ_Заказы.Заказ1С)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ШтрихкодУпаковкиРТУ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг,
		|	ВТ_ШтрихкодУпаковкиРТУ.Номенклатура КАК Номенклатура,
		|	ВТ_ШтрихкодУпаковкиРТУ.Характеристика КАК Характеристика,
		|	ВТ_ШтрихкодУпаковкиРТУ.Количество КАК Количество,
		|	ВТ_ШтрихкодУпаковкиРТУ.НомерГТД КАК НомерГТД
		|ИЗ
		|	ВТ_ШтрихкодУпаковкиРТУ КАК ВТ_ШтрихкодУпаковкиРТУ
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияТоваровУслуг,
		|	Номенклатура,
		|	Характеристика";
		
		
		ЗапросГТД.УстановитьПараметр("ТЗ", ТЗ_Заказы);
		
		РезультатЗапросаГТД = ЗапросГТД.Выполнить();
		
		Выборка_ГТД = РезультатЗапросаГТД.Выбрать();
		
		Количество = 0;
		НомерСтр = 1;
		
		ТекНоменклатура = Неопределено;
		ТекХарактеристика = Неопределено;
		ТекРеализацияТоваровУслуг = Неопределено;
		
		ТЗ_ГТД = Новый ТаблицаЗначений;
		ТЗ_ГТД.Колонки.Добавить("Количество"); 
		ТЗ_ГТД.Колонки.Добавить("РеализацияТоваровУслуг");
		ТЗ_ГТД.Колонки.Добавить("НомерСтр"); 
		
		ТЗ_ГТД.Колонки.Добавить("Номенклатура");
		ТЗ_ГТД.Колонки.Добавить("Характеристика");  
		
		ТЗ_ГТД.Колонки.Добавить("НомерГТД");
		
		Пока Выборка_ГТД.Следующий() Цикл
			
			Если Выборка_ГТД.РеализацияТоваровУслуг = Null Тогда
				Продолжить;	
			КонецЕсли;
			
			Пока Не Количество = Выборка_ГТД.Количество Цикл
				
				Если Выборка_ГТД.РеализацияТоваровУслуг = ТекРеализацияТоваровУслуг И Выборка_ГТД.Номенклатура = ТекНоменклатура И Выборка_ГТД.Характеристика = ТекХарактеристика Тогда				
					НомерСтр = НомерСтр + 1;	
				Иначе	
					НомерСтр = 1;		
				КонецЕсли;
				
				
				Количество = Количество + 1;
				
				НоваяСтрока = ТЗ_ГТД.Добавить();
				НоваяСтрока.НомерСтр = НомерСтр;
				НоваяСтрока.Количество = Количество;
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка_ГТД);
				
				ТекНоменклатура = НоваяСтрока.Номенклатура;
				ТекХарактеристика = НоваяСтрока.Характеристика;
				ТекРеализацияТоваровУслуг = НоваяСтрока.РеализацияТоваровУслуг; 				
				
			КонецЦикла;
			
			Количество = 0;
			
		КонецЦикла;
		
		Для Каждого Строка Из ТЗ_Заказы Цикл 
			
			Отбор = Новый Структура(); 
			
			Отбор.Вставить("НомерСтр", Строка.НомерСтр);
			Отбор.Вставить("Номенклатура", Строка.Номенклатура);
			Отбор.Вставить("Характеристика", Строка.Характеристика);
			
			МассивГТД = ТЗ_ГТД.НайтиСтроки(Отбор);
			
			Если МассивГТД.Количество() = 0 Тогда
				Продолжить;	
			КонецЕсли;
			
			Для Каждого Элемент Из МассивГТД Цикл 
				
				НомерГТД = Элемент.НомерГТД.РегистрационныйНомер;
				
				Строка.НомерГТД = НомерГТД;
				
				ТЗ_ГТД.Удалить(Элемент);
				
				Прервать;
				
			КонецЦикла;	
			
		КонецЦикла;
		
		
	КонецЕсли;	
	
	//- ИнфоСофт Заварин К.В. 18.03.25 УА #79811
	
	Для Каждого Строка Из ТЗ_Заказы Цикл 
		
		Отбор = Новый Структура(); 
		
		Отбор.Вставить("НомерСтр", Строка.НомерСтр);
		Отбор.Вставить("Номенклатура", Строка.Номенклатура);
		Отбор.Вставить("Характеристика", Строка.Характеристика);
		
		МассивКизов = ТЗ_КиЗы.НайтиСтроки(Отбор);
		
		Если МассивКизов.Количество() = 0 Тогда
			Продолжить;	
		КонецЕсли;
		
		Для Каждого Элемент Из МассивКизов Цикл 
			
			//+ ИнфоСофт Мурсалимов Д.Р. 05.08.24 УА #80967
			КодМаркировки = ИС_MP_Маркировка.ПолучитьКизНоменклатуры(Элемент);
			
			Строка.КодМаркировки = КодМаркировки;
			//- ИнфоСофт Мурсалимов Д.Р. 05.08.24 УА #80967
						
			ТЗ_КиЗы.Удалить(Элемент);
			
			Прервать;
			
		КонецЦикла;	
		
	КонецЦикла;
	
	Для Каждого Строка Из ТЗ_Заказы Цикл 
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("posting_number", Строка.НомерОтправления);
		
		Результат = ИС_Ozon_Сервер.ПолучитьДанныеСозданныхЭкземпляров(Профиль, СтруктураДанных);  
		
		Если Результат = Неопределено Тогда			
			ОбщегоНазначения.СообщитьПользователю("Получение данных по созданным экземплярам завершилось с ошибкой");
			Продолжить;
		КонецЕсли; 
		
		Для Каждого Product Из Результат.products Цикл 
			
			Отбор = Новый Структура(); 	
			Отбор.Вставить("product_id", Product.product_id); 
			Отбор.Вставить("НомерОтправления", Строка.НомерОтправления);
			
			МассивЗаказов = ТЗ_Заказы.НайтиСтроки(Отбор);                 
			
			Если МассивЗаказов.Количество() = 0 Тогда
				Продолжить;	
			КонецЕсли; 
			
			Для Каждого Экземпляр Из Product.exemplars Цикл
				
				Для Каждого Элемент Из МассивЗаказов Цикл 
					
					Если ЗначениеЗаполнено(Элемент.exemplar_id) Тогда
						Продолжить;
					КонецЕсли;
					
					Элемент.exemplar_id = Экземпляр.exemplar_id;
					Прервать;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла; 
	
	Для Каждого Строка Из ТЗ_Заказы Цикл 
		
		НоваяСтрока = ДанныеКВыгрузке.Добавить();		
		//+ ИнфоСофт Заварин К.В. 18.03.25 УА #79811
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "НомерОтправления,Номенклатура,Характеристика,КодМаркировки,offer_id,product_id,exemplar_id");     
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "НомерОтправления,Номенклатура,Характеристика,КодМаркировки, НеобходимаПередачаГТД, НомерГТД,offer_id,product_id,exemplar_id");    
		//- ИнфоСофт Заварин К.В. 18.03.25 УА #79811
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 19.04.24 УА #74269	

//+ ИнфоСофт Мурсалимов Д.Р. 20.04.24 УА #70514
&НаСервере
Процедура ВыгрузитьКиЗыНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_ДанныеПоКизам.product_id КАК product_id,
	|	ВТ_ДанныеПоКизам.exemplar_id КАК exemplar_id,
	|	ВТ_ДанныеПоКизам.НомерОтправления КАК НомерОтправления,
	//+ ИнфоСофт Заварин К.В. 18.03.25 УА #79811              
	|	ВТ_ДанныеПоКизам.НомерГТД КАК НомерГТД,
	|	ВТ_ДанныеПоКизам.НеобходимаПередачаГТД КАК НеобходимаПередачаГТД,
	//- ИнфоСофт Заварин К.В. 18.03.25 УА #79811
	|	ВТ_ДанныеПоКизам.КодМаркировки КАК КодМаркировки
	|ПОМЕСТИТЬ ВТ_ДанныеКиЗов
	|ИЗ
	|	&ВТ_ДанныеПоКизам КАК ВТ_ДанныеПоКизам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеКиЗов.product_id КАК product_id,
	|	ВТ_ДанныеКиЗов.exemplar_id КАК exemplar_id,
	|	ВТ_ДанныеКиЗов.НомерОтправления КАК НомерОтправления,
	//+ ИнфоСофт Заварин К.В. 18.03.25 УА #79811              
	|	ВТ_ДанныеКиЗов.НомерГТД КАК НомерГТД,
	|	ВТ_ДанныеКиЗов.НеобходимаПередачаГТД КАК НеобходимаПередачаГТД,
	//- ИнфоСофт Заварин К.В. 18.03.25 УА #79811
	|	ВТ_ДанныеКиЗов.КодМаркировки КАК КодМаркировки
	|ИЗ
	|	ВТ_ДанныеКиЗов КАК ВТ_ДанныеКиЗов
	|ИТОГИ ПО
	|	НомерОтправления,
	|	product_id";
	
	Запрос.УстановитьПараметр("ВТ_ДанныеПоКизам", ДанныеКВыгрузке.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНомерОтправления = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//+ ИнфоСофт Заварин К.В. 04.04.25 УА #95143 
	РазделительGS1 = МенеджерОборудованияМаркировкаКлиентСервер.РазделительGS1();
	ЭкранированныйСимволGS1 = "\u001d";
	//- ИнфоСофт Заварин К.В. 04.04.25 УА #95143
	
	Пока ВыборкаНомерОтправления.Следующий() Цикл
	
		ВыборкаProductId = ВыборкаНомерОтправления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		МассивProducts = Новый Массив;

		Пока ВыборкаProductId.Следующий() Цикл
			
			СтруктураProducts = Новый Структура;
			
			ВыборкаКиЗов = ВыборкаProductId.Выбрать();   	 
			
			МассивЭкземпляров = Новый Массив;
			
			Пока ВыборкаКиЗов.Следующий() Цикл
				
				СтруктураЭкземпляров = Новый Структура;
				
				СтруктураЭкземпляров.Вставить("exemplar_id", 	ВыборкаКиЗов.exemplar_id);
				//+ ИнфоСофт Заварин К.В. 18.03.25 УА #79811
				Если ВыборкаКиЗов.НеобходимаПередачаГТД И Не ПустаяСтрока(ВыборкаКиЗов.НомерГТД) Тогда
					СтруктураЭкземпляров.Вставить("gtd", 		ВыборкаКиЗов.НомерГТД);
				ИначеЕсли ВыборкаКиЗов.НеобходимаПередачаГТД И ПустаяСтрока(ВыборкаКиЗов.НомерГТД) Тогда
					СтруктураЭкземпляров.Вставить("is_gtd_abscent", Истина);	
				КонецЕсли; 
				
				Если Не ПустаяСтрока(ВыборкаКиЗов.КодМаркировки) Тогда
					//+ ИнфоСофт Заварин К.В. 04.04.25 УА #95143
					//СтруктураЭкземпляров.Вставить("mandatory_mark", ВыборкаКиЗов.КодМаркировки);
					
					КодМаркировкиGS1 = СтрЗаменить(ВыборкаКиЗов.КодМаркировки, ЭкранированныйСимволGS1, РазделительGS1);
					СтруктураЭкземпляров.Вставить("mandatory_mark", КодМаркировкиGS1);
					//- ИнфоСофт Заварин К.В. 04.04.25 УА #95143
				КонецЕсли;	
				
				//СтруктураЭкземпляров.Вставить("mandatory_mark", ВыборкаКиЗов.КодМаркировки);
				//- ИнфоСофт Заварин К.В. 18.03.25 УА #79811
				
				МассивЭкземпляров.Добавить(СтруктураЭкземпляров);	
				
			КонецЦикла;                                           
			
			СтруктураProducts.Вставить("exemplars", 	МассивЭкземпляров);
			СтруктураProducts.Вставить("product_id", 	ВыборкаProductId.product_id); 
			
			МассивProducts.Добавить(СтруктураProducts);
			
		КонецЦикла;
		
		СтруктураДанных = Новый Структура;
			
		СтруктураДанных.Вставить("products", 		МассивProducts);
		СтруктураДанных.Вставить("posting_number", 	ВыборкаНомерОтправления.НомерОтправления);
		
		Результат = ИС_Ozon_Сервер.ПрикрепитьКиз(Профиль, СтруктураДанных);

		Если Результат = Неопределено Тогда
			Продолжить;
		Иначе
			
			Отбор = Новый Структура("НомерОтправления", ВыборкаНомерОтправления.НомерОтправления);
			НайденныеСтроки = ДанныеКВыгрузке.НайтиСтроки(Отбор);
			
			Для Каждого Строка Из НайденныеСтроки Цикл
				Строка.Выгружен = Истина;
				
				//+ ИнфоСофт Заварин К.В. 20.02.25 УА #73904
				МассивКодов = Новый Массив;
				
				МассивКодов.Добавить(Строка);
				
				ЗаказМП = Документы.ИС_Ozon_Заказ.НайтиПоНомеру(ВыборкаНомерОтправления.НомерОтправления);
				ИС_MP_Сервер.ЗаписатьДанныеКИЗ(Профиль, Перечисления.ИС_МП_Маркетплейсы.Озон, ЗаказМП, МассивКодов); 	
				//- ИнфоСофт Заварин К.В. 20.02.25 УА #73904
				
			КонецЦикла;
				
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 20.04.24 УА #70514 

//+ ИнфоСофт Мурсалимов Д.Р. 01.11.23 УА #62673
&НаКлиенте
Процедура ВыгрузитьКиЗыЗавершение(Результат, Параметры) Экспорт
	
	Если Результат.Значение = КодВозвратаДиалога.Да Тогда 
		ВыгрузитьКиЗыНаСервере();
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка КиЗов отменена!");
	КонецЕсли;
	
КонецПроцедуры
//- ИнфоСофт Мурсалимов Д.Р. 01.11.23 УА #62673 

//+ ИнфоСофт Заварин К.В. 03.04.25 УА #95143
&НаКлиенте
Процедура ОбработатьШтрихкоды(Данные)
	
	СчитанныйШтрихкод = Данные.Штрихкод;
	
	РазделительGS1 = МенеджерОборудованияМаркировкаКлиентСервер.РазделительGS1();
	ЭкранированныйСимволGS1 = "";
	
	КодМаркировки = СтрЗаменить(СчитанныйШтрихкод, РазделительGS1, ЭкранированныйСимволGS1); 
	
	ПолныйКодМаркировки = КодМаркировки;
	
	КодМаркировки = ОбработатьШтрихкодыНаСервере(КодМаркировки);
	
	Отбор = Новый Структура("КодМаркировки", КодМаркировки);
	НайденныеСтроки = ДанныеКВыгрузке.НайтиСтроки(Отбор);
	
	ЭкранированныйСимволGS1 = "\u001d";
	
	ПолныйКодМаркировки = СтрЗаменить(СчитанныйШтрихкод, РазделительGS1, ЭкранированныйСимволGS1);
	
	Если Не НайденныеСтроки.Количество() = 0 Тогда
		Для Каждого Строка Из НайденныеСтроки Цикл
			Строка.КодМаркировки = ПолныйКодМаркировки;
		КонецЦикла;	   
	Иначе
		Для Каждого Элемент Из Элементы.ДанныеКВыгрузке.ВыделенныеСтроки Цикл 
			ДанныеКВыгрузке[Элемент].КодМаркировки = ПолныйКодМаркировки;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры 	//- ИнфоСофт Заварин К.В. 03.04.25 УА #95143


//+ ИнфоСофт Заварин К.В. 03.04.25 УА #95143
&НаСервере
Функция ОбработатьШтрихкодыНаСервере(ДанныеШтрихкода)
			
	Данные = Новый Структура; 
	
	Данные.Вставить("ЗначениеШтрихкода", ДанныеШтрихкода);
	
	КодМаркировки = ИС_MP_Маркировка.ПолучитьКизНоменклатуры(Данные);
	
	Возврат	КодМаркировки;  
	
КонецФункции //- ИнфоСофт Заварин К.В. 03.04.25 УА #95143

#КонецОбласти
